{"_id":"note:lUqa6R7Nf0","title":"Objectives","content":"Helpful Resources\nDocumentation and Books to Build Your Data Science Knowledge\nCongratulations on enrolling in the Data Scientist Career Path. We’re excited that you’re here. To help you during your learning journey, we’re sharing with you a set of resources. These resources include popular data science resources on the web, as well as recommended, optional books that can be used to supplement our Codecademy content.\nPopular Data Science Resources\n\nAs you go through the path, we’ll suggest certain resources for you to use, like articles, videos, tutorials, and documentation. Here are some additional resources that are considered groundbreaking, significant, or classics in the industry and will help you throughout your Path:\n\n\n\n    •\tDocumentation: The Python Standard Library\n    •\tDocumentation: Jupyter Notebook\n    •\tResource: SQL Cheatsheet\n    •\tResource: Regex Cheatsheet\n    •\tDocumentation: pandas documentation\n    •\tDocumentation: NumPy Manual\n    •\tResource: Statistics for Data Analysis Cheatsheet\n    •\tResource: Hypothesis Testing Cheatsheet\n    •\tDocumentation: Matplotlib: Python plotting\n    •\tDocumentation: API reference — seaborn\n    •\tResource: The Data Visualization Catalogue\n\n\nGo ahead and bookmark these resources—you won’t need them now, but they’ll be useful to reference and use as you go through the Path.\nRecommended Books\nCodecademy prides itself on its interactive lessons, but sometimes it’s useful to have a couple of books on hand. The books featured in this Path are considered classics in the industry and many Codecademy learners (and employees!) have found them useful.\n\n    •\tBook: A Whirlwind Tour of Python, Jake VanderPlas\n    •\tBook: Python for Data Analysis: Data Wrangling with Pandas, Numpy, and Ipython, Wes McKinney\n    •\tBook: Python Data Science Handbook, Jake VanderPlas, also available for free here\n    •\tBook: Algorithms of Oppression: How Search Engines Reinforce Racism, Safiya Umoja Noble\n    •\tBook: Introduction to Machine Learning with Python: A Guide for Data Scientists, Andreas C. Müller, Sarah Guido\n    •\tBook: Weapons of Math Destruction: How Big Data Increases Inequality and Threatens Democracy, Cathy O’Neil\n    •\tBook: Python Feature Engineering Cookbook, Soledad Galli\n    •\tBook: Deep Learning with Python, François Chollet\n\n\n\nWhile the books listed are recommended and will help you on your coding journey, purchasing and reading them is optional. When possible, we’ve suggested a free alternative. The content covers the same topics that you’ll find in our own lessons, but may be useful for those who want another explanation, perspective, or other opportunities for practice.\n\nFor those who choose to use them, relevant chapters and sections are woven throughout the syllabus. For those who are not using them, when you encounter a content item that is a reading, click the ‘Next’ button to move forward to the next content item. It will still count towards your overall progress, meaning that you do not need to purchase and read the books to complete these paths and receive a certificate.\nBest of luck!\n\n","tags":[],"folderPathname":"/📙 Data Science","data":{},"createdAt":"2021-12-22T06:08:16.131Z","updatedAt":"2021-12-22T06:25:12.341Z","trashed":false,"_rev":"nISSF8Uhs"}